app/controllers/v1/netflix_title_controller.rb

    def index
      netflix_titles = NetflixTitle.all
      render json: netflix_titles.order(:year)
---
SELECT "netflix_titles".* FROM "netflix_titles" ORDER BY "netflix_titles"."year" ASC